Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lb.main will be updated in-place
~ resource "aws_lb" "main" {
        id                         = "arn:aws:elasticloadbalancing:us-east-1:096370227225:loadbalancer/app/atlantis-lb-tf/4b8c24863f4c2a19"
        name                       = "atlantis-lb-tf"
      ~ security_groups            = [
          - "sg-0d3ffc63bdbdbc728",
        ] -> (known after apply)
        tags                       = {
            "Environment" = "atlantis"
        }
        # (14 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }

  # aws_network_interface.test will be updated in-place
~ resource "aws_network_interface" "test" {
        id                 = "eni-02e2497bb0a8dad65"
      ~ security_groups    = [
          - "sg-0d3ffc63bdbdbc728",
        ] -> (known after apply)
        tags               = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_security_group.allow_atlantis must be replaced
-/+ resource "aws_security_group" "allow_atlantis" {
      ~ arn                    = "arn:aws:ec2:us-east-1:096370227225:security-group/sg-0d3ffc63bdbdbc728" -> (known after apply)
      ~ description            = "Allow atlantis inbound traffic" -> "Allow atlantis inbound traffic (alb)" # forces replacement
      ~ id                     = "sg-0d3ffc63bdbdbc728" -> (known after apply)
        name                   = "allow_atlantis"
      + name_prefix            = (known after apply)
      ~ owner_id               = "096370227225" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.allow_ssh will be created
+ resource "aws_security_group" "allow_ssh" {
      + arn                    = (known after apply)
      + description            = "Allow ssh inbound traffic (instance)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "22 from world"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "allow_ssh"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-06ed4f95b2d90bfde"
    }

Plan: 2 to add, 2 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.jmvbxx.com/lock?id=jmvbxx%252Fatlantis-ansible%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>
Plan: 2 to add, 2 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
